#1)კომენტარის სახით ახსენით რაში გამოიყენება sliceing და რას გადავცემთ მას

#Slicing გამოიყენება winadadebis ან სიების ნაწილებად დაჭრისთვის

#2)მომხმარებელს შემოატანინეთ თავისი გვარი, შემდეგ შეამოწმეთ თუ მისი გვარი სრულდება "shvili"-ზე, მაშინ დაბეჭდეთ "Hello" / თუ სრუდება "dze"-ზე, მაშინ დაბეჭდეთ "Bye"


lastname = "lomsadze"

if lastname == "shvili":
    print("hello!")

else:
    print("bye")


#3)მომხმარებელს შემოატანინეთ წინადადება, შემდეგ შემოატანინეთ იდნექსი და გამოიტანეთ ამ წინადადების ნაწილი დაწყებული 0-დან დამთავრებული მომხმარებლის ინდექსამდე

surname = "lomsadze"
print(surname[:])


#4)ცვლადში შეინახეთ თქვენი ასაკი და while ციკლი ამუშავეთ იქამდე სანამ არ მიაღწევს თქვენი (ასაკი * 3)-ს (ყოველ ჯერზე დაბეჭდეთ თქვენი ასაკი და გვერძე მიუწერეთ "year"

age = 14

while age <= 42:
    age += 1
    print(age)
    break


#5)სიაში შეინახეთ 10 ელემენტი და sliceing-ის მეშვეობით გამოიტანეთ ყველა ლუწ ინდექსზე მდგომი ელემენტი

items = ('luka','zeti','yveli','xorci','dato','rdze','gio','nika','saba','puri')

print(items[::2])