name=input("შმოიტანე შენი სახელი:")
lastname=input("შემოიტანე შენი გვარი:")
age=input("შემოიტანე შენი ასაკი:")

#ეს არის ჩემი სახელი გვარი და ასაკი.მე გამოვიყენე input-ი.





num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))
print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)

#მე გამოვიყენე num1 და nam2, ეს არის კოდი რითიც შეგვიძლია გავაკეთოდ მათემატიკური გამოთვლები.


email=input("შეიყვანე შენი ემაილი:")
password=input("შეიყვანე შენი პაროლი:")

#ეს იგივეა რაც პირველი ოღონდ ამის სახელები განსხვავებულია მაგალითად პირველში ეწერა name და აქ წერია email.
