#for loop გამოყენებით დაპრინტეთ რიცხვები 0-დან 20მდე.
#გამოიყენეთ continue statement რათა არ დაიპრინტოს 15.


#while ციკლის მეშვეობით შედით უსასრულობის ციკლში.
#ციკლის გარეთ შექმენით ცვლადი რომელიც უდრის 0-ს. ციკლში ამ ცვლადს დაუმატეთ ყოველ დატრიალებაზე 1 და როდესაც ჩვენი ცვლადი გახდება 14 შეწყვიტეთ ციკლი break მეშვეობით.




#-----1-----



for i in range(21):
    if i == 15:
        continue

    print(i)
    



num = 0

while True:
    num += 1

    print(num)
    if num == 14:
        break
