#1. რიცხვების დაბეჭდვა 1-დან 5-მდედაწერე პროგრამა, რომელიც while ციკლის გამოყენებით დაბეჭდავს რიცხვებს 1-დან 5-მდე.

#2. რიცხვების ჯამი 1-დან 10-მდედაწერე პროგრამა, რომელიც while ციკლის გამოყენებით გამოთვლის და დაბეჭდავს რიცხვების ჯამს 1-დან 10-მდე.

#3. მომხმარებლისგან რიცხვის შეყვანადაწერე პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს რიცხვი და while ციკლის გამოყენებით დაბეჭდავს ამ რიცხვამდე ყველა მთელ რიცხვს.

#4. პაროლის შემოწმებადაწერე პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს პაროლი. თუ პაროლი არასწორია, განაგრძე კითხვა, სანამ არ შეიყვანს სწორ პაროლს (სწორი_პაროლი = "1234").

#5. რიცხვის გამოცნობადაწერე პროგრამა, რომელიც სთხოვს მომხმარებელს გამოიცნოს რიცხვი (მაგ., სწორი_რიცხვი = 7). თუ რიცხვი არასწორია, განაგრძე კითხვა, სანამ არ გამოიცნობს სწორად.


num = 1
while num <= 5:
    print(num)
    num += 1


num = 1
total = 0
while num <= 10:
    total += num
    num += 1
print(total)


num = int(input("შეიყვანეთ რიცხვი: "))  
i = 15
while i <= num:
    print(i)
    i += 15

correct_password = "564740"

while True:
    password = input("შეიყვანეთ პაროლი: ")
    if password == correct_password:
        print("პაროლი სწორია!")
        break
    else:
        print("არასწორი პაროლი სცადეთ კიდევ")