#list1 = [2, 51, 11, 13, 51, 100]



#1) სიიდან გამოიტანეთ ყველა დადებითი ინდექსის მქონდე ელემენტი.

list1 = [2, 51, 11, 13, 51, 100]
print(list1[0:6])

#2) სიიდან გამოიტანეთ ყველა უარყოფითი ინდექსის მქონე ელემენტი.

list1 = [2, 51, 11, 13, 51, 100]
print(list1[-6:])

#3) სიაში შეცვალეთ ბოლო ელემენტი ახალი მნიშვნელობით.

list2 = [3, 4, 6, 11, 25, 68]

list2[-1] = 21
print(list2)

#4) სიაში შეცვალეთ მე-5 ელემენტი ახალი მნიშვნელობით.

list3 = [3, 4, 6, 11, 25, 68]

list3[4] = 12
print(list3)


#5) შექმენით 10 ელემენტიანი list'ი და კომენტარის სახით დანომრეთ (მიუწერეთ ინდექსები). შემდეგ კი უბრალოდ გამოიტანეთ ეკრანზე.

#           0        1         2         3      4      5       6         7          8        9 
random = ['book', 'saba', 'notebook', 'nika', 'pen', 'gio', 'ruler', 'sabdro', 'macbook', 'luka'  ]
print(random)

#6) პირველ დავალებაში შექმნილი List'იდან გამოიტანეთ პირველი სამი, ბოლო სამი და შუა 4 დადებითი ინდექსებით. (slicing)
list1 = [2, 51, 11, 13, 51, 100]
print(list1[0:3])

list1 = [2, 51, 11, 13, 51, 100]
print(list1[3:])

list1 = [2, 51, 11, 13, 51, 100]
print(list1[1:5])


#7) პირველ დავალებაში შექმნილი List'იდან გამოიტანეთ პირველი სამი, ბოლო სამი და შუა 4 უარყოფითი ინდექსებით. (slicing)

list1 = [2, 51, 11, 13, 51, 100]
print(list1[-6:-3])

list1 = [2, 51, 11, 13, 51, 100]
print(list1[-3:])

list1 = [2, 51, 11, 13, 51, 100]
print(list1[-5:-1])

#8) შექმენით სტრინგი და შეატრიალეთ მისი სიმბოლოები ანუ თუ თავიდან იქნებოდა "Hello" გახდეს "olleH" 

name = "saba"

reversed_name = name [::-1]

print(reversed_name)