#1. for loop გამოყენებით დაპრინტეთ რიცხვები 0-დან 100მდე.
#გამოიყენეთ continue statement რათა არ დაიპრინტოს 15,27,67,32,99,93.


#2. while ციკლის მეშვეობით შედით უსასრულობის ციკლში.
#ციკლის გარეთ შექმენით ცვლადი რომელიც უდრის 0-ს. ციკლში ამ ცვლადს დაუმატეთ ყოველ დატრიალებაზე 1 და
#როდესაც ჩვენი ცვლადი გახდება 23 შეწყვიტეთ ციკლი break მეშვეობით.

#3. შექმენით სია და ჩაამატეთ 5 მონაცემი.

#append მეშვეობით სიის ბოლოში დაამატეთ 2 ახალი მონაცემი.

#4.  შექმენით 2D მატრიცა სადაც მეორე სიიდან უნდა ამოიღოთ 3 პოზიციაზე მდგომი მონაცემი და დაპრინტოთ.


#-----1-----
array = [15,27,67,32,99,93]

for i in range(101):
    if i in array:
        continue
    print(i)


#-----2-----
num = 0
while True:
    num += 1
    print(num)
    if num == 23:
        break


#-----3-----
need_to_buy = ["პური","კვერცხი","წვენი","ტყემალი","მარილი"]
store = ["პური","კვერცხი","წვენი","ტყემალი"]
array = []

for i in need_to_buy:
    if i in store:
        array.append(i)
    else:
        print("ეს პროდუქტი გაიყიდა")

print(array)

#-----4-----
matrix = [
    [1,2,3,4],
    [5,6,7,8]
]

print(matrix[1][3])